[
    {
        "title": "Applying Deep Learning to Identify Genes, Metabolites, and the Relationships Between Them",
        "authors": ["Logan Mills", "Bridget McInnes", "Clint Cuffy", "Sarah Golding"],
        "year": 2023,
        "venue": "Annual Biomedical Research Conference for Minority Students",
        "venueAbbreviation": "ABRCMS",
        "link": "https://www.abstractsonline.com/pp8/#!/20103/presentation/1486",
        "abstract": "Within the biomedical field, investigations into biological pathways are rapidly increasing along with the number of publications, leading to a staggering amount of information. This constantly increasing mountain of research fosters the need for efficient methods to extract relevant information. To remedy this issue, we employ Natural Language Processing systems to perform Named Entity Recognition (NER), which aims to identify the relevant entities within text, and Relationship Extraction (RE), which aims to identify pertinent relationships between relevant entities found by the NER system. A combination of these systems provides a tool for quickly parsing thousands of documents and identifying fruitful relationships within biological pathways, so that resources may be focused on investigating potential treatments for diseases. In this study, we test the performance of our NER and RE systems on two datasets detailing entity and relationship information within genetic and metabolic pathways. For NER, we compared several BERT models within MedaCy, our NER system designed for text extraction within documents, to identify metabolite, gene, and disease terms. MedaCy's predictions were then fed into RelEx, a convolutional neural network designed for the identification of relationships between labeled entities within a sentence or segments of a sentence. We evaluate our systems using Precision, Recall and F1-score to compare the performance of our models predictions for each task, NER and RE, independently. In addition, we also compare our single task approaches to our end-to-end environment. Our results show that employing the BioBERT model for NER yields the greatest performance among all compared BERT models. For RE, we found that our sentence-based approach performs the best for identifying relevant relationships between entities. In the future, we plan to investigate the application of a Graph Convolutional Network for RE as well as create a more specialized NER system for identifying entities within these biological pathways.",
        "tags": ["Natural Language Processing", "Machine Learning", "Biomedical Research"]
    },
    {
        "title": "Exploring the Future of Autonomous Truck Platooning: A Focus on Trust and Reliability",
        "authors": ["Logan Mills", "Pedro Augusto Francisco", "Rosanne Vrugtman", "Briana Morrison"],
        "year": 2025,
        "venue": "University of Virginia Library, LibraETD Repository",
        "link": "https://doi.org/10.18130/9acs-a848",
        "abstract": "The emergence of autonomous truck platooning demands investigating real-world system reliability and socioeconomic consequences. As these systems become more integrated into transportation networks, a systematic review of reliability and fault areas becomes increasingly important. By systematically cataloguing and analyzing fault modes in real-world conditions, we can improve overall dependability, safety, and operational readiness of autonomous truck platoons. System dependability is critical for widespread deployment; however, understanding the impacts of this technology on the trucking industry is necessary for adoption. Autonomous trucks will fundamentally change the traditional role of truckers; understanding their perspectives and investigating the consequences of restructuring is essential. One of the most common reservations truckers have about truck platooning surrounds its reliability; by transparently improving technical dependability and safety, drivers will be more open to accepting autonomous systems. By recording and categorizing fault points in operational contexts, trends can be identified, and the technology's overall fault tolerance will improve. This research outlines a methodology for consistently recording and categorizing faults in the real-world use of autonomous truck platooning. New faults will emerge in real-world environments; acknowledging and addressing these faults is key to improving overall system reliability and trust. Highlighting and improving the most fault-prone components in the system will propel development with a focus on the fault-tolerance aspect of the technology. Improving fault tolerance will enhance the safety of the technology as well as the trust in its abilities. Drivers must feel safe and have complete trust for autonomous truck platooning to work; driver trust will also improve by addressing the common fault points. Truck platooning adoption will depend heavily on the current drivers’ acceptance. What are drivers’ current views about autonomous truck platooning? How will this technology affect drivers? Answering these questions provides insights into how to improve the relationship between drivers and the industry. By conducting a literature review of driver interviews and the history of innovation in trucking, and analyzing the industry as a network of human and non-human actors using Actor Network Theory, a better understanding of the impacts emerges. Specifically, truck driving has traditionally been a very independent profession, and introducing platooning introduces a new connection that many drivers find difficult to accept. This new reliance on other drivers, along with reliance on automation, causes a fundamental shift in the trucking industry. Historically, drivers have not been receptive to change, especially since innovation often comes at the cost of their autonomy, something truck drivers value greatly. As autonomous truck platooning adoption continues, understanding the network and the shifts this innovation will cause is necessary to limit the alienation of the already dwindling number of truck drivers.",
        "tags": ["Autonomous Vehicles", "Truck Platooning", "Reliability Engineering", "Human Factors", "Trust in Technology", "Actor Network Theory"]
    }
]